Revit 2027 API
BarTerminationsData.HookTypeIdAtStart Property
 Identifies the hook type at the start of bar. Setting this property to a valid value, will set the CrankTypeIdAtStart and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HookTypeIdAtStart { get; set; }
Public Property HookTypeIdAtStart As ElementId
	Get
	Set
public:
property ElementId^ HookTypeIdAtStart {
	ElementId^ get ();
	void set (ElementId^ value);
}
member HookTypeIdAtStart : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: hookTypeIdAtStart doesn't represent a hook type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BarTerminationsData Class
Autodesk.Revit.DB.Structure Namespace